app/Controllers/Country.php

SELECT *
FROM `country`
---
	public function index()
	{
		$data['countries'] = $this->country->findAll();