app/Controllers/States.php

    public function index()
    {
        $limit = 10;
        $page_no = 1;
        $offset = ($page_no - 1)*$limit;
        $data['states'] = $this->state->findAll($limit,$offset);
        $data['trecords'] = $this->state->countAllResults();
---
SELECT *
FROM `state`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `state`

    public function indexBody()
    {
        $limit = 10;
        $page_no = $this->request->getGet('page');
        $offset = ($page_no - 1)*$limit;
        $data['params'] = array(
            'page_title' => "The States And Countries",
            'page_heading' => "States List",
            'rows' => $limit,
            'page' => $page_no,
            'offset' => $offset,
        );

         print_r($data['params']);
        $data['states'] = $this->state->findAll($limit,$offset);
        echo $this->state->getLastQuery();
        $data['trecords'] = $this->state->countAllResults();
---
SELECT *
FROM `state`
 LIMIT 10, 10
SELECT COUNT(*) AS `numrows`
FROM `state`