app/Controllers/Student.php

SELECT *
FROM `students`
---
    public function index(): string
    {
        // echo base_url();
        // echo $_SERVER['DOCUMENT_ROOT'].WEBROOT;exit;
        $data['students'] = $this->student->findAll();

SELECT *
FROM `students`
WHERE `students`.`id` = '1'
---
    public function editStudent()
    {
        $id = $this->request->getGet('id');
        $data['courses'] = $this->student->getCourses();
        $data['hobbies'] = $this->student->getHobbies();
        $data['studentsedit'] = $this->student->find($id);