app/Models/Student_model.php

SELECT *
FROM `course`
---
	public function getCourses()
	{
		return $this->db->table('course')->get()->getResultArray();

SELECT *
FROM `hobbies`
---
	public function getHobbies()
	{
		return $this->db->table('hobbies')->get()->getResultArray();